      * Bewoner
         03 (pf)-BewonersID.
           05 (pf)-Reserveringsnummer PIC 9(8) VALUE ZERO.
           05 (pf)-Volgnummer PIC 9 VALUE ZERO.
         03 (pf)-Initialen PIC X(5) VALUE SPACES.
         03 (pf)-Geboortedatum PIC X(8) VALUE SPACES.