      * Mutatie
         03 (pf)-Reserveringsnummer PIC 9(8) VALUE ZERO.
         03 (pf)-Mutatietype PIC XX.
           88 (pf)-AnnuleringReservering VALUE "AR".
           88 (pf)-BetalingReservering VALUE "BR".
           88 (pf)-AnnuleringBoeking VALUE "AB".
         03 (pf)-Mutatiedatum PIC X(8).