       IDENTIFICATION DIVISION.
       PROGRAM-ID. PlanOnderhoud.
       AUTHOR. Joey Schmitz en Max Mukidjam.
       DATE-WRITTEN. 02-03-2023.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       BeginProgram.
           
           EXIT PROGRAM.

           

