       program-id. Program1 as "Huur_een_vakantieavontuur.Program1".

       data division.
       working-storage section.

       procedure division.
      
           DISPLAY "CONFLICT"

           goback.

       end program Program1.
       