       IDENTIFICATION DIVISION.
       PROGRAM-ID. VoorbeeldProgramma.
       AUTHOR. Joey Schmitz.
       DATE-WRITTEN. ??-01-2023.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       BeginProgram.
           
           STOP RUN.

           

