       IDENTIFICATION DIVISION.
       PROGRAM-ID. WijzigKlantgegevens.
       AUTHOR. Joey Schmitz en Michaël Koning.
       DATE-WRITTEN. 03-03-2023.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       BeginProgram.
           
           STOP RUN.

           

